package example;

/**
 * Домашнее задание №1.
 * Дано: целочисленный массив numbers размером n.
 * Ожидание: все четные числа должны быть в начале, а нечетные после четных чисел.
 */
class HomeWork2 {

    /**
     * Сортировка массива по четным и нечетным значениям.
     *
     * @param numbers - целочисленный массив, пример [5, 6, 1, 2].
     * @return - целочисленный массив, пример результата [6, 2, 5, 1].
     */
    public int[] run(int[] numbers) {
        // TODO реализовать тут
        return null;
    }

}
