package example;

/**
 * Домашнее задание №1.
 * Дано: Целочисленный не пустой массив с повторяющимися значениями от 0 до 10
 * Ожидание: Вернуть уникальный элемент массива
 *
 * Дополнение со звездочкой: Выполнить алгоритм O(n)
 */
public class HomeWork1 {

    /**
     * Поиск элемента, который встречается в массиве только 1 раз
     *
     * @param num - целочисленный массив со значениями от 0 до 10
     * @return уникальный элемент массива
     */
    public int singleNumber(int[] num) {
        // TODO
        return -1;
    }
}
