package algorithms;

/**
 * Домашнее задание №1.
 * Дано: Целочисленный массив
 * Ожидание: Проверить на уникальность всех элементов в массиве,
 * не создавая при этом новый массив
 */
public class HomeWork1 {

    /**
     * На входе целочисленный массив
     * Необходимо проверить все ли элементы массива различны
     *
     * @param numbers - массив. Пример: [1,2,3]
     * @return - true массив уникален, а false не уникален
     */
    public boolean checkIsUnique(int[] numbers) {

        return true;
    }
}


